docs/posts/2015-03-27-the-crossshattered-christ-chapter-4.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 31, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Cross-Shattered Christ, Chapter 4</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">The Cross-Shattered Christ, Chapter 4</h1>
<p class="subtitle" role="doc-subtitle">Mar 27, 2015</p>
</header><p>
So far, this has been the most challenging and difficult chapter for me. Hauerwas challenges us reflect on our standard interpretations of Jesus&rsquo; cry of despair from the cross, &ldquo;My God, my God, why have you forsaken me?&rdquo; and understand it not in terms of one who is sacrificed to satisfy a vengeful God, but as a cry from the God who both sacrifices and is sacrificed. That we find this cry of Jesus so difficult to comprehend shows that we, as citizens of this world, understand and identify with the power and authority of the empire. Instead, &ldquo;Jesus refuses to accept the terms of how the world understands power and authority&#x2026;. We are the spared because God refuses to have us lost.&rdquo;<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>
</p>

<p>
God refuses to play by our rules. Thanks be to God.
</p>

<div class="tagline" id="orgaac7f74">
<p>
Tagged: <a href="../tags/religion.html">Religion</a>
</p>

</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes</h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Hauerwas, Stanley (2005-01-01). <i>Cross-Shattered Christ: Meditations on the Seven Last Words</i> (pp. 51-52). Baker Publishing Group. Kindle Edition. 
</p></div></div>


</div>
</div></main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 31, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
